Tekla Open API Reference for Tekla Structures 2025
AnalysisModel.SecondaryKeepAxis Property
 Gets or sets the secondary keep axis settings. Not used, bracing/secondary members always have KEEP_AXIS_NO initially.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisModel.KeepAxisEnum SecondaryKeepAxis { get; set; }
Public Property SecondaryKeepAxis As AnalysisModel.KeepAxisEnum
	Get
	Set
Property Value
Type: AnalysisModel.KeepAxisEnum
See Also
Reference
AnalysisModel Class
Tekla.Structures.Analysis Namespace